cool/tutorials/incompressible/pimpleDyMFoam/wingMotion/wingMotion2D_simpleFoam/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wing
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    "(front|back|topAndBottom|inlet|outlet)"
    {
        type            calculated;
        value           uniform 0;
    }
}

// ************************************************************************* //
